backend/app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "anon: b5856"], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello"], ["user_id", 130], ["created_at", "2022-02-21 06:18:38.185803"], ["updated_at", "2022-02-21 06:18:38.185803"]]
---
  def create
    user = User.find_by(username: params[:message][:username])
    @message = Message.new(user_id: user.id, content: params[:message][:content])

    if @message.save